; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	image1 - mode
	spectrograph2 - mode
	thermograph0 - mode
	GroundStation0 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	Star4 - direction
	Star6 - direction
	GroundStation10 - direction
	Star11 - direction
	Star12 - direction
	GroundStation8 - direction
	Star7 - direction
	GroundStation9 - direction
	Star5 - direction
	Planet13 - direction
	Star14 - direction
	Phenomenon15 - direction
	Phenomenon16 - direction
	Planet17 - direction
	Star18 - direction
	Phenomenon19 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 Star7)
	(calibration_target instrument0 GroundStation8)
	(supports instrument1 thermograph0)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 Star5)
	(calibration_target instrument1 GroundStation9)
	(calibration_target instrument1 Star7)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation2)
)
(:goal (and
	(have_image Planet13 image1)
	(have_image Star14 thermograph0)
	(have_image Phenomenon15 thermograph0)
	(have_image Phenomenon16 image1)
	(have_image Planet17 spectrograph2)
	(have_image Star18 thermograph0)
	(have_image Phenomenon19 thermograph0)
))

)

; plan
1. (turn_to satellite0 groundstation9 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 groundstation9)
   goals met: 0 of 7
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 7
3. (calibrate satellite0 instrument1 groundstation9)
   added: (calibrated instrument1)
   goals met: 0 of 7
4. (turn_to satellite0 planet17 groundstation9)
   deleted: (pointing satellite0 groundstation9)
   added: (pointing satellite0 planet17)
   goals met: 0 of 7
5. (take_image satellite0 planet17 instrument1 spectrograph2)
   added: (have_image planet17 spectrograph2)
   goals met: 1 of 7
6. (turn_to satellite0 groundstation8 planet17)
   deleted: (pointing satellite0 planet17)
   added: (pointing satellite0 groundstation8)
   goals met: 1 of 7
7. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 1 of 7
8. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 7
9. (calibrate satellite0 instrument0 groundstation8)
   added: (calibrated instrument0)
   goals met: 1 of 7
10. (turn_to satellite0 phenomenon15 groundstation8)
   deleted: (pointing satellite0 groundstation8)
   added: (pointing satellite0 phenomenon15)
   goals met: 1 of 7
11. (take_image satellite0 phenomenon15 instrument0 thermograph0)
   added: (have_image phenomenon15 thermograph0)
   goals met: 2 of 7
12. (turn_to satellite0 phenomenon16 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 phenomenon16)
   goals met: 2 of 7
13. (take_image satellite0 phenomenon16 instrument0 image1)
   added: (have_image phenomenon16 image1)
   goals met: 3 of 7
14. (turn_to satellite0 phenomenon19 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 phenomenon19)
   goals met: 3 of 7
15. (take_image satellite0 phenomenon19 instrument0 thermograph0)
   added: (have_image phenomenon19 thermograph0)
   goals met: 4 of 7
16. (turn_to satellite0 planet13 phenomenon19)
   deleted: (pointing satellite0 phenomenon19)
   added: (pointing satellite0 planet13)
   goals met: 4 of 7
17. (take_image satellite0 planet13 instrument0 image1)
   added: (have_image planet13 image1)
   goals met: 5 of 7
18. (turn_to satellite0 star14 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 star14)
   goals met: 5 of 7
19. (take_image satellite0 star14 instrument0 thermograph0)
   added: (have_image star14 thermograph0)
   goals met: 6 of 7
20. (turn_to satellite0 star18 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star18)
   goals met: 6 of 7
21. (take_image satellite0 star18 instrument0 thermograph0)
   added: (have_image star18 thermograph0)
   goals met: 7 of 7
